### PANDAS

In [84]:
pip install pandas

Requirement already satisfied: pandas in c:\users\koushik\desktop\python\python_1\venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\koushik\desktop\python\python_1\venv\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\koushik\desktop\python\python_1\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\koushik\desktop\python\python_1\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\koushik\desktop\python\python_1\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\koushik\desktop\python\python_1\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [85]:
import pandas as pd

#### pandas series is a one dimmensional array like object that can hold any datatype. it iis similar to column in a table

In [86]:
#crteating series
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [87]:
# creatung series from dict

data_1 = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data_1)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [88]:
#creating dataframes from dictionary of lists
data= {'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]}
df= pd.DataFrame(data,index=(1,2,3))
print(df)

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [89]:
#creating df from list of dictionaries
data= [{'name':'koushik','age':20},{'name':'sidvik','age':16}]
df=pd.DataFrame(data)
df

      name  age
0  koushik   20
1   sidvik   16

In [90]:
#accesing elements
df['name']

0    koushik
1     sidvik
Name: name, dtype: object

In [91]:
df.loc[0]

name    koushik
age          20
Name: 0, dtype: object

In [92]:
df.loc[0][0]

C:\Users\koushik\AppData\Local\Temp\ipykernel_10308\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'koushik'

In [93]:
df.iloc[0]

name    koushik
age          20
Name: 0, dtype: object

In [94]:
df.iloc[0][0]

C:\Users\koushik\AppData\Local\Temp\ipykernel_10308\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'koushik'

In [95]:
df.at[1,'age']

np.int64(16)

In [96]:
df.iat[1,1]

np.int64(16)

In [97]:
df

      name  age
0  koushik   20
1   sidvik   16

In [98]:
#data manipulation with dataframes
##adding a column
df['city']=['kakinada','karapa']
df

      name  age      city
0  koushik   20  kakinada
1   sidvik   16    karapa

In [99]:
#removing a column
# df.drop('city',axis=1) #rhis is temporary
df.drop('city',axis=1,inplace=True)
df

      name  age
0  koushik   20
1   sidvik   16